richmaes/nrf51822-expression/Board/pca10001/s110/ble_app_expression/main.c
/* Copyright (c) 2012 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/** @file
 *
 * @defgroup ble_sdk_app_hrs_eval_main main.c
 * @{
 * @ingroup ble_sdk_app_hrs_eval
 * @brief Main file for Heart Rate Service Sample Application for nRF51822 evaluation board
 *
 * This file contains the source code for a sample application using the Heart Rate service
 * (and also Battery and Device Information services) for the nRF51822 evaluation board (PCA10001).
 * This application uses the @ref ble_sdk_lib_conn_params module.
 */
// Un-comment this define to use a hard coded BTLE UUID instead of content from the UICR
// #define USE_FIXED_CONFIG 1
//#if defined(BOARD_NRF6310)
  
//#elif defined(BOARD_PCA10000)
  
//#elif defined(BOARD_PCA10001)
  
//#elif defined(BOARD_PCA10003)
  
//#else
    //#define REAL_ACCEL
//#endif



//  Memory contents will consists of a known header, a BTLE address and a checksum.  
// The checksum will be a 8 bit sum of the header and BTLE address ( a total of 10 bytes)
#define RAM_HEADER  { 0x55, 0xAA, 0x33, 0xCC }
#define BTLE_SN     { 0x57, 0xF9, 0x99, 0x49, 0x3D, 0xFF }


#define _GPIOTE_CONFIG_BUTTON(PIN_NO)             \
        (                                         \
          (GPIOTE_CONFIG_POLARITY_HiToLo << 16) | \
          ((PIN_NO) << 8) |                       \
          GPIOTE_CONFIG_MODE_Event                \
        )

#define GPIOTE_CONFIG_BUTTON(PIN_NO) _GPIOTE_CONFIG_BUTTON(PIN_NO)
#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "nrf_delay.h"
#include "app_error.h"
#include "nrf51_bitfields.h"
#include "ble.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_bas.h"
#include "ble_hrs.h"
#include "ble_acs.h"
#include "ble_dis.h"
#include "ble_conn_params.h"
#include "boards.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "nrf_gpio.h"
#include "led.h"
#include "battery.h"
#include "device_manager.h"
#include "app_gpiote.h"
#include "app_button.h"
#include "ble_debug_assert_handler.h"
#include "pstorage.h"
#include "app_trace.h"
#include "boards.h"


#include "bma222.h"
#include "twi_master.h"
#include "uicr.h"
#include "app_util_platform.h"


#define IS_SRVC_CHANGED_CHARACT_PRESENT      0                                          /**< Include or not the service_changed characteristic. if not enabled, the server's database cannot be changed for the lifetime of the device*/
                                                                             
#define HR_INC_BUTTON_PIN_NO                 BUTTON_0                                   /**< Button used to increment heart rate. */
#define HR_DEC_BUTTON_PIN_NO                 BUTTON_1                                   /**< Button used to decrement heart rate. */
#define BOND_DELETE_ALL_BUTTON_ID            HR_DEC_BUTTON_PIN_NO                       /**< Button used for deleting all bonded centrals during startup. */
#define UICR_ADDR                        0x10001080

#define DEVICE_NAME                          "IR Expression"                            /**< Name of device. Will be included in the advertising data. */
#define MANUFACTURER_NAME                    "Idea Rockets LLC."                        /**< Manufacturer. Will be passed to Device Information Service. */
#define APP_ADV_INTERVAL                     40                                         /**< The advertising interval (in units of 0.625 ms. This value corresponds to 25 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS           180                                        /**< The advertising timeout in units of seconds. */

//#define DICE_LED1_PIN_NO                 17                                           /*!< Pin for LED1 on Dice 600 board*/
#define DICE_LED1_PIN_NO                 23                                             /*!< Pin for LED1. original prototype */
#define DICE_LED2_PIN_NO                 29                                             /*!< Pin for LED1. original prototype */
#define ACCEL_INT1_PIN_NO                1                                              /*!< Pin for INT1. */
#define ACCEL_INT2_PIN_NO                2                                              /*!< Pin for INT2. */

#define APP_TIMER_PRESCALER                  0                                          /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_MAX_TIMERS                 5                                          /**< Maximum number of simultaneously created timers. */
#define APP_TIMER_OP_QUEUE_SIZE              5                                          /**< Size of timer operation queues. */

#define BATTERY_LEVEL_MEAS_INTERVAL          APP_TIMER_TICKS(2000, APP_TIMER_PRESCALER) /**< Battery level measurement interval (ticks). */
#define BMA222_MEAS_INTERVAL                 APP_TIMER_TICKS(50, APP_TIMER_PRESCALER)   /**< Acceloromter level measurement interval (ticks). */

#define TX_TIMEOUT_DURATION                  APP_TIMER_TICKS(120000, APP_TIMER_PRESCALER)  /*!< The time to stay a awake after waking interrupts stop being asserted. */
#define TX_TIMEOUT_SCOUNT                    (TX_TIMEOUT_DURATION / BMA222_MEAS_INTERVAL)  /*!< Calculated number of samples to meet the approximate terminal time*/

#define HEART_RATE_MEAS_INTERVAL             APP_TIMER_TICKS(1000, APP_TIMER_PRESCALER) /**< Heart rate measurement interval (ticks). */
#define MIN_HEART_RATE                       60                                         /**< Minimum heart rate as returned by the simulated measurement function. */
#define MAX_HEART_RATE                       300                                        /**< Maximum heart rate as returned by the simulated measurement function. */
#define HEART_RATE_CHANGE                    2                                          /**< Value by which the heart rate is incremented/decremented during button press. */

#define APP_GPIOTE_MAX_USERS                 1                                          /**< Maximum number of users of the GPIOTE handler. */

#define BUTTON_DETECTION_DELAY               APP_TIMER_TICKS(50, APP_TIMER_PRESCALER)   /**< Delay from a GPIOTE event until a button is reported as pushed (in number of timer ticks). */

#define MIN_CONN_INTERVAL                    MSEC_TO_UNITS(500, UNIT_1_25_MS)           /**< Minimum acceptable connection interval (0.5 seconds). */
#define MAX_CONN_INTERVAL                    MSEC_TO_UNITS(1000, UNIT_1_25_MS)          /**< Maximum acceptable connection interval (1 second). */
#define SLAVE_LATENCY                        0                                          /**< Slave latency. */
#define CONN_SUP_TIMEOUT                     MSEC_TO_UNITS(4000, UNIT_10_MS)            /**< Connection supervisory timeout (4 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY       APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER) /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY        APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER)/**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT         30                                          /**< Number of attempts before giving up the connection parameter negotiation. */

