richmaes/nrf51822-expression/Board/pca10001/s110/ble_app_expression/main.c
#define SEC_PARAM_TIMEOUT                    30                                         /**< Timeout for Pairing Request or Security Request (in seconds). */
#define SEC_PARAM_BOND                       1                                          /**< Perform bonding. */
#define SEC_PARAM_MITM                       0                                          /**< Man In The Middle protection not required. */
#define SEC_PARAM_IO_CAPABILITIES            BLE_GAP_IO_CAPS_NONE                       /**< No I/O capabilities. */
#define SEC_PARAM_OOB                        0                                          /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE               7                                          /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE               16                                         /**< Maximum encryption key size. */

#define DEAD_BEEF                            0xDEADBEEF                                 /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */



static ble_gap_adv_params_t                  m_adv_params;                              /**< Parameters to be passed to the stack when starting advertising. */
// BMA222 configuration
#define BMA222_DEVICE_ID                 0x00
#define BMA222_SDA_PIN_NO                TWI_MASTER_CONFIG_DATA_PIN_NUMBER              // BMA serial pin interfaces
#define BMA222_SCL_PIN_NO                TWI_MASTER_CONFIG_CLOCK_PIN_NUMBER             // BMA serial pin interfaces 

// LED FLASH configuration
#define LED_TOGGLE_INTERVAL              APP_TIMER_TICKS(100, APP_TIMER_PRESCALER)
#define LED_TOGGLE_DURATION              APP_TIMER_TICKS(2000, APP_TIMER_PRESCALER)    /*!< The time to stay a awake after waking interrupts stop being asserted. */
#define LED_TOGGLE_SCOUNT                (LED_TOGGLE_DURATION / LED_TOGGLE_INTERVAL)   /*!< Calculated number of samples to meet the approximate terminal time*/
ble_bas_t                                    bas;                                       /**< Structure used to identify the battery service. */
static ble_hrs_t                             m_hrs;                                     /**< Structure used to identify the heart rate service. */
static ble_acs_t                             m_lbs;
static volatile uint16_t                     m_cur_heart_rate;                          /**< Current heart rate value. */
                                                                                       
static app_timer_id_t                        m_battery_timer_id;                        /**< Battery timer. */
static app_timer_id_t                        m_accel_timer_id;                          /**< Accelerometer timer. */

static bool                                  m_memory_access_in_progress = false;       /**< Flag to keep track of ongoing operations on persistent memory. */
static dm_application_instance_t             m_app_handle;                              /**< Application identifier allocated by device manager */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt);

static void sys_evt_dispatch(uint32_t sys_evt);


/*****************************************************************************
* Error Handling Functions
*****************************************************************************/


static bool                              s_useLEDs = false;         /*!< Enable LED control for use by application*/
static uint8_t                           s_LED_state = 0;           /*!< Keep track of LED's states to control turn on and off of LED's*/

void dly5ms(void);				  // 5 miliseconds delay
void dly50ms(void);               // 50 milisecond delay
void dly100ms(void);              // 100 milisecond delay
void dly250ms(void);			  // 250 miliseconds delay 
static void doubleFlashAlternating(void);
static void ledParser(uint8_t report_val);
uint8_t my_address[6] =  /*!< Assign a default address. */
{
    0x01, /* 0x01  */
    0x02, /* 0x02  */
    0x03, /* 0x03  */
    0x04, /* 0x04  */
    0x05, /* 0x05  */
    0x06  /* 0x06  */
};

uint16_t tx_timeout = TX_TIMEOUT_SCOUNT;
uint16_t flash_timeout = 0;
/**@brief Function for error handling, which is called when an error has occurred. 
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze 
 *          how your product is supposed to react in case of error.
 *
 * @param[in] error_code  Error code supplied to the handler.
 * @param[in] line_num    Line number where the handler is called.
 * @param[in] p_file_name Pointer to the file name. 
 */
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{
    // This call can be used for debug purposes during application development.
    // @note CAUTION: Activating this code will write the stack to flash on an error.
    //                This function should NOT be used in a final product.
    //                It is intended STRICTLY for development/debugging purposes.
    //                The flash write will happen EVEN if the radio is active, thus interrupting
    //                any communication.
    //                Use with care. Un-comment the line below to use.
    // ble_debug_assert_handler(error_code, line_num, p_file_name);

    // On assert, the system can only recover with a reset.
    NVIC_SystemReset();
}


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze 
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


static void led_write_handler(ble_acs_t * p_lbs, uint8_t led_state)
{
	//ledParser(led_state);
}


/*****************************************************************************
* Static Timeout Handling Functions
*****************************************************************************/

