richmaes/nrf51822-expression/Board/pca10001/s110/ble_app_expression/main.c
    // unexpected interrupts
    if (
       (NRF_GPIOTE->EVENTS_IN[2] != 0)
       &&
       ((NRF_GPIOTE->INTENSET & GPIOTE_INTENSET_IN2_Msk) != 0)
       )
    {
        NRF_GPIOTE->EVENTS_IN[2] = 0;
}

    if (
       (NRF_GPIOTE->EVENTS_IN[3] != 0)
       &&
       ((NRF_GPIOTE->INTENSET & GPIOTE_INTENSET_IN3_Msk) != 0)
       )
    {
        NRF_GPIOTE->EVENTS_IN[3] = 0;
}

    if (
       (NRF_GPIOTE->EVENTS_PORT != 0)
       &&
       ((NRF_GPIOTE->INTENSET & GPIOTE_INTENSET_PORT_Msk) != 0)
       )
    {
        NRF_GPIOTE->EVENTS_PORT = 0;
}
}


/**@brief Initialize GPIOTE module for detecting acceleration interrupts.
 */
static void acc_int_init(void)
{
    //uint32_t err_code;
    //uint32_t per_rdy;

    // Initialize GPIOTE module
    NRF_GPIOTE->INTENCLR = 0xffffffffUL;
    NRF_GPIOTE->CONFIG[0]    = GPIOTE_CONFIG_BUTTON(ACCEL_INT1_PIN_NO);
    NRF_GPIOTE->CONFIG[1]    = GPIOTE_CONFIG_BUTTON(ACCEL_INT2_PIN_NO);
    NRF_GPIOTE->EVENTS_IN[0] = 0;
    NRF_GPIOTE->EVENTS_IN[1] = 0;
    NRF_GPIOTE->INTENSET     = GPIOTE_INTENSET_IN0_Msk | GPIOTE_INTENSET_IN1_Msk ;

    // Turn on the sense detect to trigger wakeup when the device is asleep.
    NRF_GPIO->PIN_CNF[ACCEL_INT1_PIN_NO] = (GPIO_PIN_CNF_SENSE_High     << GPIO_PIN_CNF_SENSE_Pos);
    NRF_GPIO->PIN_CNF[ACCEL_INT2_PIN_NO] = (GPIO_PIN_CNF_SENSE_High     << GPIO_PIN_CNF_SENSE_Pos);

    //err_code = sd_nvic_ClearPendingIRQ(GPIOTE_IRQn);
	NVIC_ClearPendingIRQ(GPIOTE_IRQn);
    // nrf_gpio_pin_clear(DICE_LED2_PIN_NO);
    // nrf_gpio_pin_set(DICE_LED2_PIN_NO);
    
    NVIC_SetPriority(GPIOTE_IRQn, APP_IRQ_PRIORITY_HIGH);

	NVIC_EnableIRQ(GPIOTE_IRQn);
}

 /*
 * @param[in]   sys_evt   System stack event.
 */
static void sys_evt_dispatch(uint32_t sys_evt)
{
    pstorage_sys_event_handler(sys_evt);
    on_sys_evt(sys_evt);
}


/*****************************************************************************
* Main Function
*****************************************************************************/

/**@brief Function for the application main entry.
 */
int main(void)
{
    uint32_t err_code;
    // Initialize
    leds_init();
	
	// Double flash the LED's to validate initialization 
	//doubleFlashAlternating();

    // Activate the TWI interface for accelerometer comms
    twi_master_init();
	  //doubleFlashAlternating();

    // Reset and initialize the accelerometer
    bma222_setDeviceAddress(BMA222E_BASE_ADDRESS_DEV0);
    if (bma222_reset()) {
        bma222_init(BMA222E_BASE_ADDRESS_DEV0);
	} else {
		bma222_setDeviceAddress(BMA222_BASE_ADDRESS_DEV0);
		bma222_reset();
		bma222_init(BMA222_BASE_ADDRESS_DEV0);
		
	}
	
	
    timers_init();
    gpiote_init();

	
//    buttons_init();
    
    ble_stack_init();
    doubleFlashAlternating();


    device_manager_init();


    // Initialize Bluetooth Stack parameters.
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();

    // Start advertising.
    advertising_start();


    // Enter main loop.
    for (;;)
    {
        // Switch to a low power state until an event is available for the application
        err_code = sd_app_evt_wait();
        APP_ERROR_CHECK(err_code);
    }
}

void doubleFlashAlternating(void) {
	   uint8_t i = 0;
    // Turn LED's off and on alternatley.  Always turn off previous LED first before turning on other LED.
           //nrf_gpio_pin_clear(DICE_LED1_PIN_NO);
           //  for (i = 0; i < 10; i++) {
           //     dly5ms();
           //  }
           // nrf_gpio_pin_clear(DICE_LED1_PIN_NO);
           //  for (i = 0; i < 10; i++) {
           //     dly5ms();
           //  }
       for (int jj = 0; jj < 2; jj = jj +1) {
           nrf_gpio_pin_clear(DICE_LED1_PIN_NO);
                 //dly50ms();
                 //nrf_gpio_pin_clear(DICE_LED1_PIN_NO);
                 dly50ms();
                 nrf_gpio_pin_set(DICE_LED1_PIN_NO);
                 dly50ms();
                 nrf_gpio_pin_clear(DICE_LED1_PIN_NO);
                 dly50ms();
                 nrf_gpio_pin_set(DICE_LED1_PIN_NO);
                 dly50ms();
                 nrf_gpio_pin_clear(DICE_LED1_PIN_NO);
                 dly50ms();
                 nrf_gpio_pin_set(DICE_LED1_PIN_NO);

                 //nrf_gpio_pin_clear(DICE_LED2_PIN_NO);
                 dly50ms();
                 nrf_gpio_pin_clear(DICE_LED2_PIN_NO);
                 dly50ms();
                 nrf_gpio_pin_set(DICE_LED2_PIN_NO);
                 dly50ms();
                 nrf_gpio_pin_clear(DICE_LED2_PIN_NO);
                 dly50ms();
                 nrf_gpio_pin_set(DICE_LED2_PIN_NO);
                 dly50ms();
                 nrf_gpio_pin_clear(DICE_LED2_PIN_NO);
                 dly50ms();
                 nrf_gpio_pin_set(DICE_LED2_PIN_NO);
       }

}

/**
 * @}
 */

void dly5ms(void)				  // 5 miliseconds delay 
{ unsigned char j = 100      ;		// 100 * 50usec = 5 msec 
	while (--j) {
		nrf_delay_us(50)   ;
	}  
}

void dly50ms(void)				  // 50 miliseconds delay 
{ unsigned int j = 1000      ;		// 1000 * 50usec = 50 msec 
	while (--j) {
		nrf_delay_us(50)   ;
	}  
}

void dly100ms(void)				  // 100 miliseconds delay 
{ unsigned int j = 2000      ;		// 2000 * 50usec = 100 msec 
	while (--j) {
		nrf_delay_us(50)   ;
	}  
}

void dly250ms(void)				  // 250 miliseconds delay 
{ unsigned char k = 50       ;		//  50 * 5 msec = 250 msec 
	while (--k) {
		dly5ms()      ;
	}	 // usefull for messages' display
}  
